{"meta":{"title":"眸瑞项目文档","subtitle":null,"description":null,"author":"普贤","url":"http://yoursite.com"},"pages":[{"title":"","date":"2017-07-14T09:25:45.710Z","updated":"2017-07-14T09:25:45.710Z","comments":false,"path":"tags/index.html","permalink":"http://yoursite.com/tags/index.html","excerpt":"","text":""},{"title":"","date":"2017-07-14T09:25:37.091Z","updated":"2017-07-14T09:25:37.091Z","comments":false,"path":"categories/index.html","permalink":"http://yoursite.com/categories/index.html","excerpt":"","text":""}],"posts":[{"title":"test.md","slug":"test-md","date":"2017-07-17T03:55:16.000Z","updated":"2017-07-17T03:55:16.894Z","comments":true,"path":"2017/07/17/test-md/","link":"","permalink":"http://yoursite.com/2017/07/17/test-md/","excerpt":"","text":"","categories":[],"tags":[]},{"title":"实物在线-App-v1.0","slug":"实物在线-App-v1.0","date":"2017-07-15T02:55:56.000Z","updated":"2017-07-15T02:57:36.451Z","comments":true,"path":"2017/07/15/实物在线-App-v1.0/","link":"","permalink":"http://yoursite.com/2017/07/15/实物在线-App-v1.0/","excerpt":"","text":"实物在线-App-v1.0 需求文档 项目名称: 定制试场-App-M-v1.0 项目经理: 小钻风-李红艳 撰写人 文晶晶 文档版本： V1.0 撰写日期: 2017/07/03 版本发布日期: 审批人: 审批日期: 修改记录 日期 姓名 版本号 修改内容 2017/07/03 文晶晶 V1.0 初次梳理产品需求 1、功能需求1.1、软件启动 启动页面 （启动页） 功能描述 启动软件，停留2s跳转 1.2、软件特性 （软件特性） 功能描述 软件特性展示：新用户进入APP时展示软件特性，可以左右滑动切换页面； 1.3、登录1.3.1登录 （登录） 字段名称 是否必填 字段长度 初始键盘 提示文字 其他规则 手机号 是 11 数字键盘 请输入手机号码进行登录 第1位必须=1,第二位不能=1/2/6/9,不符合规则提交的时候显示toast”请输入正确的手机号码” 密码 是 6-18 字母全键盘 请输入密码进行登录 输入的内容必须=密码,不符合规则提交的时候显示toast“账号/密码不正确” （账号、密码规则） 功能描述 返回：返回到上一页 账号/密码录入：规则见上表（账号、密码规则） 注册入口：点击跳转 忘记密码入口：点击跳转 登录提交入口：点击提交系统判断，并显示对应toast 快捷登录入口：点击跳转 录入清空：已录入内容时，显示清空按钮，点击清空输入内容 单点登录：需实现单点登录功能，同一账号同时只能登录一个移动终端APP，具体规则见功能逻辑； 功能逻辑 同一时间同一账户只能登录一个移动终端APP； 用户登录账号时系统需判断是否有其他移动终端(APP)在登录中，如有则强制下线并弹窗提示“您的账号在其他移动终端登录，已下线”； 点击确定关闭弹窗并刷新页面； 1.3.2快捷登录 （社交平台快捷登录） 功能描述 用户点击微信/QQ跳转至微信/QQAPP内获得授权，获得授权后系统需获取用户的微信/QQ昵称+微信/QQ头像，获取完成后跳转至绑定手机页面； 功能逻辑 用户点击微信快捷登录时，系统需判断微信是否绑定手机账号，如已绑定则显示登录成功；如未绑定的情况下则需要跳转至注册页面； 1.4、注册 （新账号注册） 字段名称 是否必填 字段长度 初始键盘 提示文字 其他规则 手机号 是 11 数字键盘 请输入手机号码进行登录 第1位必须=1 密码 是 6-18 字母全键盘 请输入密码进行登录 输入的内容必须=规则 验证码 是 4 数字键盘 请输入验证码 验证码有效时间30分钟 第二位不能=1/2/6/9 不符合规则提交的时候显示toast”请输入正确的手机号码” 不支持标点符号、表情 不符合规则提交的时候显示toast“密码不符合规则” 获取验证码时间间隔=60s 不符合规则时显示toast“验证码不正确”，未填时显示“请输入验证码” 功能描述 手机号录入：录入字段 验证码获取：点击发送验证码，判断账号是否符合规则 验证码录入：录入字段 登录入口：点击跳转 账号提交：提交账号与验证码，系统判断，显示对应toast 密码录入：录入字段 密码提交：提交密码，系统判断，符合规则完成注册流程，不符合显示对应toast，并停留在当前页面 录入清空：已录入内容时，显示清空按钮，点击清空输入内容 功能逻辑 1.5、找回密码 （找回密码） 字段名称 是否必填 字段长度 初始键盘 提示文字 其他规则 手机号 是 11 数字键盘 请输入手机号码进行登录 第1位必须=1 密码 是 6-18 字母全键盘 请输入密码进行登录 输入的内容必须=规则 验证码 是 4 数字键盘 请输入验证码 验证码有效时间30分钟 第二位不能=1/2/6/9 不符合规则提交的时候显示toast”请输入正确的手机号码” 不支持标点符号、表情 不符合规则提交的时候显示toast“密码不符合规则” 获取验证码时间间隔=60s 不符合规则时显示toast“验证码不正确”，未填时显示“请输入验证码” 功能描述 手机号录入：录入字段 验证码获取：点击发送验证码，判断账号是否符合规则 验证码录入：录入字段 返回：点击回到上一页 账号提交：提交账号与验证码，系统判断，显示对应toast 密码录入：录入字段 密码提交：提交密码，系统判断，符合规则完成找回密码流程，不符合显示对应toast，并停留在当前页面 录入清空：已录入内容时，显示清空按钮，点击清空输入内容 1.6、实物展厅 （实物展厅-热门） 功能描述 热门：按浏览量排序，展示已发布展示中的demo； 字段：标题、发布人用户名/企业名称、浏览量 U3D入口：点击demo区域进入U3D； 最新入口：点击最新、右滑页面进入最新展厅； 展厅刷新：双击主菜单展厅ICON，页面自动回到顶部，刷新当前页面； 展示：一页展示20条数据，用户看到第20条可上拉加载后面的20条； 空数据：没有数据时页面结构不变，显示空数据页面； 我的入口：点击跳转； 刷新/加载：当前页面有下拉刷新，上拉加载功能 （实物展厅-最新） 功能描述 热门：按demo最新发布时间排序，展示已发布展示中的demo； 字段：标题、发布人用户名/企业名称、浏览量 U3D入口：点击demo区域进入U3D； 最新入口：点击最新、左滑页面进入最新展厅； 展厅刷新：双击主菜单展厅ICON，页面自动回到顶部，刷新当前页面； 展示：一页展示20条数据，用户看到第20条可上拉加载后面的20条； 空数据：没有数据时页面结构不变，显示空数据页面； 我的入口：点击跳转； 刷新/加载：当前页面有下拉刷新，上拉加载功能 1.7、3D场景1.7.1 loding （Loding） 功能描述 返回：点击回到上一页； 加载进度条：实时展示当前加载进度，并显示加载数值； 提示文案：2秒切换一次，文案内容可换； 1.7.2 产品使用场景 （产品使用场景-初始页面） 功能描述 返回：点击显示弹窗，询问是否退出，点击确定完成退出操作，取消关闭弹窗停留在当前页面； ./media/image16.png 商品详情入口：点击详情按钮进入商品详情页面； 菜单：点击展开菜单； 浏览量：显示当前产品的总浏览数； 浏览量实时新增效果：用户在场景内时，浏览量新增时总浏览数更新，并且需显示+1效果，无新增浏览量时效果1s后渐隐，有新浏览量时+1快速隐藏； 商品信息：场景内显示商品品牌、商品名称； 数据记录：系统需记录用户停留时间，点击按钮的次数与种类； 共享：点击共享展开共享面板； 清单：点击清单进入清单页面； 场景：点击场景展开场景选择面板； 模型交互：点击商品模型进入交互模式，交互模式仅显示交互菜单与返回按钮，其他信息隐藏； 缩放：双指操作可完成缩小/放大镜头的操作； （产品使用场景-产品交互） 功能描述 返回：点击显示弹窗，询问是否退出，点击确定完成退出操作，取消关闭弹窗停留在当前页面； 颜色：点击显示颜色面板，选择颜色即可更换模型颜色； 尺寸：模型在选中时显示尺寸； 材质：点击隐藏尺寸，显示模型的材质； 旋转：点击隐藏交互菜单，显示旋转面板，用户可操纵模型在原地进行360°旋转； 开关：点击开启产品仿真开关； 灯光：点击打开灯管调节面板，用户通过拖拽的方式可调节环境灯光，具体灯光区间需模型组协助确定； 退出交互模式：点击非模型位置； 当前页面上的交互是指用户在商家/服务商已设置/制作好的产品参数中进行基础查看、交互的操作，不具备保存功能； （场景切换面板） 功能描述 当前场景展示：使用中的场景显示使用中状态； 场景名称：展示内容； 场景图片：展示内容； 切换场景：点击未使用场景，关闭面板切换场景，这里的切换场景要求不是跳转加载新场景，而是在当前页面加载新场景； 取消：关闭面板，回到上一页； 1.7.2 产品展示场景 （产品展示场景） 功能描述 产品展示场景：展示场景旨在最大化的突出产品，用户在场景中无法移动产品，仅能进行360°旋转、缩放等操作； 商品信息：展示商家在PC端维护的商品信息，字段以PC段客户需求为准； 收回详情：商品详情信息默认展开，点击收回完成收回操作； 返回：点击返回回到上一页； 1.7.3 共享场景 （共享邀请） 功能描述 微信分享/授权接口：通过接口用户可获得用户微信头像、用户名等信息，并分享邀请卡片至微信好友； QQ分享/授权接口：通过接口用户可获得用户QQ头像、用户名等信息，并分享邀请卡片至QQ好友； 功能逻辑 ./media/image21.png 系统判断已有五个，用户发起第六个时，需有对应文字提示“共享空间创建数量已达上限，请稍后再试”； 当共享空间内无数据传输/用户停留，则即时关闭空间； 关闭空间后用户点击共享链接默认进入普通demo界面； 邀请后即生成共享空间，其他用户通过点击链接即可进入对应页面； 其他用户通过APP分享的链接可进入对应H5页面查看，系统需判断当前机器是否已安装APP，如已安装则需要通过html调起本地APP并进入APP内对应共享空间； 发起共享邀请需要登录； 查看者不需要登录，显示默认头像； （共享场景-操作者） 功能描述 返回：点击显示弹窗询问“是否退出共享模式？”，点击确定回到上一场景，点击取消关闭弹窗停留当前场景； 音频：操作者音频默认开启，点击可完成关闭/开启操作，显示对应toast“音频已开启/音频已关闭”； 实时语音：打开后用户说话即可传输语音信息，操作者默认开启，点击可完成关闭/开启操作，显示对应toast“实时语音已开启/实时语音已关闭”； 商品信息：场景内显示商品品牌、商品名称； 数据记录：系统需记录用户停留时间，点击按钮的次数与种类； 人员显示：显示当前在线用户社交平台头像，操作者显示操作字段，用户退出后隐藏头像； 功能逻辑 ./media/image24.png （退出、关闭空间逻辑） 人数上限：最多同时容纳三名用户访问，满员时有新的用户进入需显示toast“抱歉，共享房间已满员”，并进入非共享的产品使用场景； 房间关闭：系统需判断当前房间是否有用户留存，如判断结果为无，则关闭共享房间； 用户通过外链进入已关闭的房间：默认跳转到产品初始场景； 操作权限更替：操作权限默认在房主（邀请者），房主退出后操作权限按照进入房间的时间进行更替，先到者先得，操作权限仅有一名用户； 操作权限：有操作权限即可对模型进行交互、编辑操作，查看者可实时看到操作动态、效果； 音频：查看者进入共享房间，音频功能默认开启； 1.7.4 清单 （场景清单） 功能描述 返回：点击返回回到上一页； 道具：展示使用场景中使用到的所有道具，道具有3D展厅的显示3D展厅入口，有购买链接的显示购买入口； 道具图片：展示内容； 3D展厅入口：点击进入产品3D展厅 使用场景：展示产品关联的所有使用场景名称、图片、价格； 购买入口：根据客户需求显示，点击跳转至对应链接； 1.8、我的1.8.1 我的首页 （我的-会员） 功能描述 消息入口：点击跳转 用户头像展示：展示用户头像，无头像显示默认头像 用户身份展示：显示用户身份 用户会员权限时间：展示会员权限多少天后到期 展示管理入口：点击跳转 意见与问题入口：点击跳转 设置入口：点击跳转 平台客服电话：点击展示弹窗，用户可选择是否拨号，拨号调取手机拨号功能 展厅入口：点击跳转 （我的-非会员） 功能描述 消息入口：点击跳转 用户头像展示：展示用户头像，无头像显示默认头像 用户身份展示：显示用户身份 展示管理入口：点击跳转 意见与问题入口：点击跳转 设置入口：点击跳转 平台客服电话：点击展示弹窗，用户可选择是否拨号，拨号调取手机拨号功能 展厅入口：点击跳转 （我的-未登录） 功能描述 消息入口：点击跳转至登录 头像展示：展示缺省默认头像 平台slogan展示：展示内容 展示管理入口：点击跳转 意见与问题入口：点击跳转至登录 设置入口：点击跳转 平台客服电话：点击展示弹窗，用户可选择是否拨号，拨号调取手机拨号功能 展厅入口：点击跳转 1.8.2 消息 （消息） 功能描述 未读消息提醒：在当前页面未读消息展示未读标识，用户进入详情后不再显示未读消息； 新消息提醒：这里的提醒指展示在展厅/我的页面右上方ICON红点，用户进入消息列表即不再显示； 返回：返回至上一页； 消息详情：点击跳转； 删除消息：IOS左划，显示删除； 安卓长按，显示删除弹窗； 1.8.3 展示管理 （展示管理） 功能描述 展示图片：展示demo图片； 浏览量：显示当前demo浏览量； 状态：当前demo状态，展示中/未发布 标题：当前demo标题 编辑入口：点击demo显示编辑菜单； 取消发布：点击显示弹窗，询问是否取消发布，点击确定完成取消发布操作； 3D展厅入口：点击跳转进入U3D； 分享：点击打开分享面板； 分享至社交平台：点击跳转至社交平台，应完成朋友圈、微信好友、QQ的接口对接； 生成二维码：点击生成当前demo的二维码，并显示toast“二维码已保存在手机相册”； 复制链接：点击复制demo链接，并显示toast“链接已复制” 取消：点击取消关闭弹层/菜单 功能逻辑 展示中：展示中的demo有取消发布、进入3D展厅、分享操作； 未发布：未发布的demo有立即发布操作； 排序：展示管理中的demo按照最新保存时间进行排序，时间越近越靠前； 1.8.4 软件设置1.8.4.1 软件设置首页 （我的-软件设置） 功能描述 未登录：未登录时不显示修改登录密码与退出当前账号按钮； 修改登录密码：点击跳转； 清理缓存：显示缓存值，点击完成清理缓存操作，这里清理缓存要求包括U3D的内容； 清理完毕需显示toast“软件缓存已完成清理”，当缓存=0显示toast“软件无缓存” 推送设置：默认开启推送设置，用户自主关闭时，不再收到系统栏的消息提醒； 退出当前账号：点击显示弹窗“是否退出当前账号？”点击确认完成退出操作，取消关闭弹窗； 账号退出后回到首页（展厅）； 1.8.4.2修改登录密码 （修改登录密码） 字段名称 是否必填 字段长度 初始键盘 提示文字 其他规则 手机号 是 11 数字键盘 请输入手机号码进行登录 第1位必须=1 密码 是 6-18 字母全键盘 请输入密码进行登录 输入的内容必须=规则 验证码 是 4 数字键盘 请输入验证码 验证码有效时间30分钟 第二位不能=1/2/6/9 不符合规则提交的时候显示toast”请输入正确的手机号码” 不支持标点符号、表情 不符合规则提交的时候显示toast“密码不符合规则” 获取验证码时间间隔=60s 不符合规则时显示toast“验证码不正确”，未填时显示“请输入验证码” 功能描述 手机号录入：录入字段 验证码获取：点击发送验证码，判断账号是否符合规则 验证码录入：录入字段 返回：点击回到上一页 账号提交：提交账号与验证码，系统判断，显示对应toast 密码录入：录入字段 密码提交：提交密码，系统判断，符合规则完成找回密码流程，不符合显示对应toast，并停留在当前页面 录入清空：已录入内容时，显示清空按钮，点击清空输入内容 1.8.4.2关于实物在线 （我的-关于实物在线） 功能描述 返回：点击返回回到上一页； 页面：当前页面为静态页面； 1.8.5 意见与问题 （我的-意见与问题） 功能描述 返回：点击返回回到上一页； 分类：显示当前内容分类，当前版本为静态内容，后期迭代需要后台设置； 反馈内容录入：200字，达到200字不能再输入，支持emoji与标点符号； 提交：点击完成内容的提交，需系统判断是否已录入反馈内容，没有显示toast“请输入反馈内容”，提交后页面自动返回至我的首页； 1.9、其他1.9.1 网络错误 （其他通用-网络错误） 功能描述 网络错误：当前页面适配于APP内所有页面，当网络不稳定、无网络时即显示当前页面； 刷新：点击刷新当前页面； 返回：返回至上一页； 1.9.2轻提示 （轻提示） 功能描述 显示：当前轻提示适用于APP内所有toast，根据功能规则展示，3s后隐藏； 1.9.3 加载1.9.3.1下拉刷新/上拉加载 （下拉刷新、上拉加载） 功能描述 下拉刷新：用户在内容头部进行下拉操作，系统显示上次更新时间，并对内容进行刷新； 上拉加载：用户在内容底部进行上拉操作，系统对后面的内容进行加载； 适用：当前功能适用于APP内所有需要功能的页面； （页面加载） 功能描述 加载：加载当前页面上的数据； 适用：当前功能适用于APP内所有需要功能的页面； 1.9.4 弹窗提示 （弹窗） 功能描述 适用：当前功能适用于APP内所有需要功能的页面； 弹窗标题：无标题的弹窗不显示标题； 说明：显示说明文案； 确定：点击确定完成操作并关闭弹窗； 取消：点击取消不进行操作并关闭弹窗； 1.9.5 数据为空 （空数据） 功能描述 适用：当前页面适用于APP内所有可能产生空数据的页面，如消息、展示管理、展厅等； 2、交互需求2.1、性能、交互需求该版本产品需在满足功能需求的前提下尽可能的提高交互体验，交互体验主要体现在以下几点： APP、U3D产品框架效果需与UI效果图保持一致； 点击按钮的区域不能出现多次点击但无反应的情况，涉及到提交数据的按钮用户发生点击操作后就需要弹出loding图标，用户不能做重复提交的操作； 所有没有数据的页面都需要显示缺省页面； APP内所有需要显示系统提示的功能部分都需按照需求显示对应提示，toast类型的提示显示3秒后需自动消失； 页面切换需快速流畅； 产品运行时需稳定流畅； 并发需求： 系统需支持同时做不同操作的用户数量为：总用户数量×5%~20% 系统响应的平均时间为5s内 系统需支持同时做一样操作的用户数量为：300人 系统响应的平均时间为5s内 3、安全要求在实物在线APPv1.0版本中，对安全要求的内容为： 涉及到U3D部分内容要求不能反编译； 涉及到用户的账户、密码、支付密码的相关内容都需加密传输存储； 涉及到支付流程、订单相关的内容在传输时需加密传输； 系统不能有安全方面的漏洞； 4、硬件环境安卓系统：要求软件在安卓系统4.4版本以上，包含4.4版本的安卓手机上运行流畅，无卡顿闪退情况。 IOS系统：要求软件在IOS系统8.0版本以上，包含8.0版本的苹果手机上运行流畅，无卡顿闪退情况。","categories":[],"tags":[{"name":"立项报告","slug":"立项报告","permalink":"http://yoursite.com/tags/立项报告/"},{"name":"里程碑","slug":"里程碑","permalink":"http://yoursite.com/tags/里程碑/"}]},{"title":"实物在线","slug":"实物在线-Pc-v1.0立项报告170710","date":"2017-07-14T09:22:02.304Z","updated":"2017-07-15T01:06:39.321Z","comments":true,"path":"2017/07/14/实物在线-Pc-v1.0立项报告170710/","link":"","permalink":"http://yoursite.com/2017/07/14/实物在线-Pc-v1.0立项报告170710/","excerpt":"","text":"《实物在线 PCV1.0》立项报告 文件标识： MRTF（AH）B2017007070001 当前版本： V1.0 编 写 人： 普贤（冯宇） 立项日期： 2017年7月7日 上线日期： 2017年8月1日 验 收 人： 芭蕉（张红娟）、巨灵神（郑巩） 验收日期： 2017年7月31日 一、项目背景 在现代社会之中，人与人之间的交流方式目前最为常见的是文字、图片、语言3种方式； 那么在21世纪这个互联网技术全面应用的时代，如何进一步拓宽、延展人与人之间的交流与沟通？如何让人与人之间的交流更加趋于趣味化、简单化？那么，基于此利用虚拟与现实技术、同时从人的情感、心理层面进行需求挖掘，设计一款应用软件让普通大众通过操作实物的虚拟模型从而达到人与人、人与物情感的交流与传递。 二、项目功能与目标项目目标： 为普通大众提供一个在线娱乐的器物交流平台； 为实体工厂提供一个实体商品全新媒介推广平台； 为大众消费者提供个性化私人订制交易平台。 项目功能： 所有的模型都能在手机上改尺寸，贴材质，实物互相配置，并能拖到用户拍摄的环境中去. web端争取在10秒内打开，交互自然流畅. 多屏互动，30人以内. 三、项目团队项目团队以公司高层及销售/运营部门为主导，网络部提供系统功能、性能和安全保证。（附：项目主要成员表） 序号 项目角色 人员名称 联系方式 本人签字 1 项目总监 布袋 18910895582 2 项目经理（移动端） 小钻风 15274935144 3 项目经理（PC端） 普贤 17773135314 4 java开发组组长 增长 18670336934 5 后台开发 土地 18874075426 6 iOS开发组组长 灵虚子 18670728389 7 android开发组组长 夜游神 18674405175 8 测试经理 巨灵神 18570620202 9 产品经理（后台） 芭蕉 15573193989 10 产品经理（app端） 阿儺 13657333933 11 产品经理（Web前台） 李德升 18613982718 12 UI小组负责人 天羽 18507331311 12 前端页面负责人 赤脚 13511117207 14 Unity组组长 水德星君 13100318619 四、项目排期周期：项目计划在7月5日启动，8月5日完成，为期1个月。(需求文档delay一天，开发完成时间相应顺延) 序号 项目里程碑 关键产出物 计划开始 计划结束 验收标准 备注 1 项目启动 《项目立项报告》、《项目排期表》 7月5日 7月5日 经项目总监签字确认 2 原型设计 《产品PRD》、《UI设计规范》、前端切图 6月26日 7月5日 经项目总监、测试组签字确认 3 系统实现 《详细设计》、《业务需求分析文档》、开发任务WBS、Coding 7月5日 8月5日 经项目总监、测试组签字确认 4 系统测试 《测试需求》、《测试用例》、《测试报告》 8月1日 8月5日 经项目总监、测试组签字确认 最终测试时间 5 上线准备 《项目环境运维文档》、《资源确认单》 7月25日 8月4日 经项目总监、网络组签字确认 6 系统上线 《部署方案说明》 8月5日 8月10日 经项目总监、网络组签字确认 7 项目验收 《项目总结报告》 8月10日 8月15日 经项目总监签字确认 整理项目相关文档 其它时间节点安排： 序号 项目里程碑 计划开始 计划结束 备注 1 完成用户中心 6.15 7.13 2 完成模型库后台系统 6.15 7.15 3 完成移动端接口 6.15 7.21 4 实物在线PC前端和运营后台 7.17 7.25 尚未开始 五、项目总监审批：","categories":[],"tags":[{"name":"立项报告","slug":"立项报告","permalink":"http://yoursite.com/tags/立项报告/"},{"name":"里程碑","slug":"里程碑","permalink":"http://yoursite.com/tags/里程碑/"}]}]}